presentations/functional/functional2.org
** No Mutating passed in variables
#+begin_notes
Lets go back to that last example. python actually does something called "pass
by reference", instead of passing by value. this means instead of creating a new
value we mutate the old on in place
#+end_notes
#+attr_reveal: :frag (roll-in)
    Pass by reference

#+attr_reveal: :frag (roll-in)
    #+begin_src python :results output
def add_name(lst, name):
    lst.append(name)

lst = []
add_name(lst, "Joe")
add_name(lst, "Kieran")

print(lst)
    #+end_src

#+attr_reveal: :frag (roll-in)
     ~['Joe', 'Kieran']~

#+reveal: split
#+begin_notes
The way we fix this is by making a copy of the list and then mutating that, or
using tuple operations...
#+end_notes

#+begin_src python :results output
def add_name(lst, name):
    new = lst.copy()
    new.append(name)
    return new

lst = []
new_lst = add_name(lst, "Joe")
new_new_lst = add_name(new_lst, "Kieran")

print(f"{lst=}\n{new_lst=}\n{new_new_lst=}")
#+end_src

: lst=[]
: new_lst=['Joe']
: new_new_lst=['Joe', 'Kieran']
** Exercise: Pure or not
We are going to play a game where we guess if certain functions from the std
library are pure, or if they do some kind of side effect.
#+attr_reveal: :frag (roll-in)
    - ~input()~
    - ~list.sort()~
    - ~sorted()~
    - ~next()~
    - ~enumerate()~
    - ~random.rand()~


* Functions, First class girlies (values)
#+begin_notes
Functions in many languages can be passed around like values.
#+end_notes

#+begin_src python :results output
def run_f(f):
    print("before f")
    f()
    print("after f")

def greeting():
    print("Hi GDSC!!")

run_f(greeting)
#+end_src

: before f
: Hi GDSC!!
: after f

#+reveal: split
#+begin_notes
When we inspect a function we can see a couple of interesting features.
Functions are objects, stored in memory and garbage collected, these objects
have a type. and these function objects have attributes on them. and we can add
our own.

We see here that functions are like any other value, just with some special
syntax to define them and use them.
#+end_notes
#+begin_src python :results output
def f():
    pass

f.my_sneaky_value = "hahahahah"
print(f)
print(type(f))
print(f.my_sneaky_value)
#+end_src

: <function f at 0x7f8e4f71a200>
: <class 'function'>
: hahahahah

** Unnamed functions
#+begin_notes
At the moment all the functions we have used have been named. but we can create
unnammed or anonymous functions. These are called lambdas in other languages.
These can be passed around like any other value and have the same types and all
that.
#+end_notes

#+begin_src python :results output
(
    lambda x: print(f"{x = }")
)(
    "a value called from outside"
)
#+end_src

#+RESULTS:
: x = 'a value called from outside'

#+reveal: split
#+begin_notes
Just to show that these are regular function values
#+end_notes

#+begin_src python :results output
f = lambda x: print(x)

f.my_sneaky_value = "hahahahah"
print(f)
print(type(f))
print(f.my_sneaky_value)
#+end_src

#+RESULTS:
: <function <lambda> at 0x7f88307da340>
: <class 'function'>
: hahahahah

** Why is this useful?
#+begin_notes
This is a question that people should have, especially when you see this for
the first time.
in essence when you want to allow for people to hook into the execution of a
kind of process without prescribing some kind of preset operation.

here in this example we essentially tell our web server whenever you hit the
root run this function and send back some html

Note in here I have not talked about returning functions or many function
operations that are quite important and useful
#+end_notes

#+attr_reveal: :frag (roll-in)
    #+begin_src rjsx
let app = require("express")()

app.get("/", function(request, result) {
  result.send("some html ig")
})
    #+end_src
