presentations/functional/functional2.html
<section id="slide-org97a0209">
<h3 id="org97a0209">No Mutating passed in variables</h3>
<aside class="notes">
<p>
Lets go back to that last example. python actually does something called &ldquo;pass
by reference&rdquo;, instead of passing by value. this means instead of creating a new
value we mutate the old on in place
</p>

</aside>
<p class="fragment (roll-in)">
Pass by reference
</p>

<div class="org-src-container">

<pre class="fragment (roll-in)"><span style="color: #b877db; font-style: italic;">def</span> <span style="color: #87ceeb;">add_name</span>(<span style="color: #e95678;">lst</span>, <span style="color: #e95678;">name</span>):
    lst.<span style="color: #21bfc2; font-style: italic;">append</span>(name)

<span style="color: #e95678;">lst</span> <span style="color: #b877db; font-style: italic;">=</span> []
<span style="color: #21bfc2;">add_name</span>(lst, <span style="color: #fab795;">"Joe"</span>)
<span style="color: #21bfc2;">add_name</span>(lst, <span style="color: #fab795;">"Kieran"</span>)

<span style="color: #b877db;">print</span>(lst)
</pre>
</div>

<p class="fragment (roll-in)">
<code>['Joe', 'Kieran']</code>
</p>

</section>
<section>
<aside class="notes">
<p>
The way we fix this is by making a copy of the list and then mutating that, or
using tuple operations&#x2026;
</p>

</aside>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">def</span> <span style="color: #87ceeb;">add_name</span>(<span style="color: #e95678;">lst</span>, <span style="color: #e95678;">name</span>):
    <span style="color: #e95678;">new</span> <span style="color: #b877db; font-style: italic;">=</span> lst.<span style="color: #21bfc2; font-style: italic;">copy</span>()
    new.<span style="color: #21bfc2; font-style: italic;">append</span>(name)
    <span style="color: #b877db; font-style: italic;">return</span> new

<span style="color: #e95678;">lst</span> <span style="color: #b877db; font-style: italic;">=</span> []
<span style="color: #e95678;">new_lst</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #21bfc2;">add_name</span>(lst, <span style="color: #fab795;">"Joe"</span>)
<span style="color: #e95678;">new_new_lst</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #21bfc2;">add_name</span>(new_lst, <span style="color: #fab795;">"Kieran"</span>)

<span style="color: #b877db;">print</span>(<span style="color: #fab795;">f"</span><span style="color: #b877db; font-style: italic;">{</span><span style="color: #c7c9cb; background-color: #232530;">lst</span><span style="color: #b877db; font-style: italic;">=</span><span style="color: #b877db; font-style: italic;">}</span><span style="color: #b877db; font-style: italic;">\n</span><span style="color: #b877db; font-style: italic;">{</span><span style="color: #c7c9cb; background-color: #232530;">new_lst</span><span style="color: #b877db; font-style: italic;">=</span><span style="color: #b877db; font-style: italic;">}</span><span style="color: #b877db; font-style: italic;">\n</span><span style="color: #b877db; font-style: italic;">{</span><span style="color: #c7c9cb; background-color: #232530;">new_new_lst</span><span style="color: #b877db; font-style: italic;">=</span><span style="color: #b877db; font-style: italic;">}</span><span style="color: #fab795;">"</span>)
</pre>
</div>

<pre class="example">
lst=[]
new_lst=['Joe']
new_new_lst=['Joe', 'Kieran']
</pre>
</section>
<section id="slide-orgb92bffe">
<h3 id="orgb92bffe">Exercise: Pure or not</h3>
<p>
We are going to play a game where we guess if certain functions from the std
library are pure, or if they do some kind of side effect.
</p>
<ul>
<li class="fragment roll-in"><code>input()</code></li>
<li class="fragment roll-in"><code>list.sort()</code></li>
<li class="fragment roll-in"><code>sorted()</code></li>
<li class="fragment roll-in"><code>next()</code></li>
<li class="fragment roll-in"><code>enumerate()</code></li>
<li class="fragment roll-in"><code>random.rand()</code></li>

</ul>


</section>
</section>
<section>
<section id="slide-org0d98b49">
<h2 id="org0d98b49">Functions, First class girlies (values)</h2>
<aside class="notes">
<p>
Functions in many languages can be passed around like values.
</p>

</aside>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">def</span> <span style="color: #87ceeb;">run_f</span>(<span style="color: #e95678;">f</span>):
    <span style="color: #b877db;">print</span>(<span style="color: #fab795;">"before f"</span>)
    <span style="color: #21bfc2;">f</span>()
    <span style="color: #b877db;">print</span>(<span style="color: #fab795;">"after f"</span>)

<span style="color: #b877db; font-style: italic;">def</span> <span style="color: #87ceeb;">greeting</span>():
    <span style="color: #b877db;">print</span>(<span style="color: #fab795;">"Hi GDSC!!"</span>)

<span style="color: #21bfc2;">run_f</span>(greeting)
</pre>
</div>

<pre class="example">
before f
Hi GDSC!!
after f
</pre>


</section>
<section>
<aside class="notes">
<p>
When we inspect a function we can see a couple of interesting features.
Functions are objects, stored in memory and garbage collected, these objects
have a type. and these function objects have attributes on them. and we can add
our own.
</p>

<p>
We see here that functions are like any other value, just with some special
syntax to define them and use them.
</p>

</aside>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">def</span> <span style="color: #87ceeb;">f</span>():
    <span style="color: #b877db; font-style: italic;">pass</span>

f.<span style="color: #e95678; font-style: italic;">my_sneaky_value</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #fab795;">"hahahahah"</span>
<span style="color: #b877db;">print</span>(f)
<span style="color: #b877db;">print</span>(<span style="color: #b877db;">type</span>(f))
<span style="color: #b877db;">print</span>(f.<span style="color: #f09383; font-style: italic;">my_sneaky_value</span>)
</pre>
</div>

<pre class="example">
&lt;function f at 0x7f8e4f71a200&gt;
&lt;class 'function'&gt;
hahahahah
</pre>

</section>
<section id="slide-org0d225b7">
<h3 id="org0d225b7">Unnamed functions</h3>
<aside class="notes">
<p>
At the moment all the functions we have used have been named. but we can create
unnammed or anonymous functions. These are called lambdas in other languages.
These can be passed around like any other value and have the same types and all
that.
</p>

</aside>

<div class="org-src-container">

<pre class="src src-python">(
    <span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #e95678;">x</span>: <span style="color: #b877db;">print</span>(<span style="color: #fab795;">f"</span><span style="color: #b877db; font-style: italic;">{</span><span style="color: #c7c9cb; background-color: #232530;">x</span><span style="color: #fab795;"> </span><span style="color: #b877db; font-style: italic;">=</span><span style="color: #fab795;"> </span><span style="color: #b877db; font-style: italic;">}</span><span style="color: #fab795;">"</span>)
)(
    <span style="color: #fab795;">"a value called from outside"</span>
)
</pre>
</div>

</section>
<section>
<aside class="notes">
<p>
Just to show that these are regular function values
</p>

</aside>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #e95678;">f</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #e95678;">x</span>: <span style="color: #b877db;">print</span>(x)

f.<span style="color: #e95678; font-style: italic;">my_sneaky_value</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #fab795;">"hahahahah"</span>
<span style="color: #b877db;">print</span>(f)
<span style="color: #b877db;">print</span>(<span style="color: #b877db;">type</span>(f))
<span style="color: #b877db;">print</span>(f.<span style="color: #f09383; font-style: italic;">my_sneaky_value</span>)
</pre>
</div>

</section>
<section id="slide-org9e2b00f">
<h3 id="org9e2b00f">Why is this useful?</h3>
<aside class="notes">
<p>
This is a question that people should have, especially when you see this for
the first time.
in essence when you want to allow for people to hook into the execution of a
kind of process without prescribing some kind of preset operation.
</p>

<p>
here in this example we essentially tell our web server whenever you hit the
root run this function and send back some html
</p>

<p>
Note in here I have not talked about returning functions or many function
operations that are quite important and useful
</p>

</aside>

<div class="org-src-container">

<pre class="fragment (roll-in)"><span style="color: #b877db; font-style: italic;">let</span> <span style="color: #e95678;">app</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db;">require</span><span style="color: #21bfc2; background-color: #232530;">(</span><span style="color: #fab795;">"express"</span><span style="color: #21bfc2; background-color: #232530;">)()</span>

app<span style="color: #c7c9cb; background-color: #232530;">.</span><span style="color: #21bfc2; font-style: italic;">get</span><span style="color: #21bfc2; background-color: #232530;">(</span><span style="color: #fab795;">"/"</span><span style="color: #c7c9cb; background-color: #232530;">,</span> <span style="color: #b877db; font-style: italic;">function</span><span style="color: #6c6f93; background-color: #232530;">(</span>request<span style="color: #c7c9cb; background-color: #232530;">,</span> result<span style="color: #6c6f93; background-color: #232530;">)</span> <span style="color: #6c6f93; background-color: #232530;">{</span>
  result<span style="color: #c7c9cb; background-color: #232530;">.</span><span style="color: #21bfc2; font-style: italic;">send</span><span style="color: #09f7a0; background-color: #232530;">(</span><span style="color: #fab795;">"some html ig"</span><span style="color: #09f7a0; background-color: #232530;">)</span>
<span style="color: #6c6f93; background-color: #232530;">}</span><span style="color: #21bfc2; background-color: #232530;">)</span>
</pre>
</div>
</section>
