presentations/functional/functional2.html
<section id="slide-org80b1404">
<h3 id="org80b1404">Exercise</h3>
<aside class="notes">
<p>
Here I am going to introduce the activity that should take us to the end as we
go through the last couple of meaty slides.
We are going to implement a stack! Now the core of our stack is going to be a
tuple that we will make copies of. Our stack starts off as an empty tuple, a
stack for those who don&rsquo;t know is a first in first out data structure (use a
list to demo). we access an element using a pop operation, we add elements to it
using the push. we will also introduce a transform function that does not touch
the stack but takes off the top element and applys a function to it.
</p>

<p>
In this case what we will do is not focus on the push and pop and put a dummy
value into the stack.
</p>

</aside>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">def</span> <span style="color: #87ceeb;">mk_stack</span>():
    <span style="color: #b877db; font-style: italic;">return</span> (<span style="color: #f09383;">4</span>,<span style="color: #f09383;">5</span>,<span style="color: #f09383;">1</span>)

<span style="color: #b877db;">print</span>(<span style="color: #21bfc2;">mk_stack</span>())
</pre>
</div>

<pre class="example">
(4, 5, 1)
</pre>


</section>
<section>

<p>
your function would look something like this
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">def</span> <span style="color: #87ceeb;">transform</span>(<span style="color: #e95678;">stk</span>, <span style="color: #e95678;">transform_function</span>):
    <span style="color: #b877db; font-style: italic;">pass</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgcede16a">
<h2 id="orgcede16a">Loops, Do not exist</h2>
<aside class="notes">
<p>
Thats right, no more for or while loops. Why some of you may ask? well loops
have implicit mutation. Lets break down what loops do.
For loops are actually while loops that call the next method on an interator.
The next method mutates its argument.
Even with while loops the same values are updated in place. Reassigning to the
same place is still mutation so we can&rsquo;t have loops.
</p>

</aside>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #e95678;">lst</span> <span style="color: #b877db; font-style: italic;">=</span> [<span style="color: #f09383;">1</span>,<span style="color: #f09383;">2</span>,<span style="color: #f09383;">3</span>]

<span style="color: #b877db; font-style: italic;">for</span> <span style="color: #e95678;">elem</span> <span style="color: #b877db; font-style: italic;">in</span> lst:
    <span style="color: #b877db;">print</span>(elem)
<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># is mostly equal too</span>
<span style="color: #e95678;">iterator</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db;">iter</span>(lst)
<span style="color: #b877db; font-style: italic;">while</span> <span style="color: #b877db;">True</span>:
   <span style="color: #b877db; font-style: italic;">try</span>:
       <span style="color: #e95678;">elem</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db;">next</span>(iterator)
   <span style="color: #b877db; font-style: italic;">except</span> <span style="color: #87ceeb;">StopIteration</span>:
       <span style="color: #b877db; font-style: italic;">break</span>
   <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># body</span>
   <span style="color: #b877db;">print</span>(elem)

</pre>
</div>

</section>
<section id="slide-org0e05d6b">
<h3 id="org0e05d6b">Recursion to the rescue!!</h3>
<aside class="notes">
<p>
Instead of using dirty, disgusting, loops which mutate there arguments, we can
use functions instead! functions which call themselves!
Because arguments are copied between function invoations we don&rsquo;t end up
mutating anything,
</p>

</aside>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">def</span> <span style="color: #87ceeb;">print_list</span>(<span style="color: #e95678;">lst</span>):
    <span style="color: #b877db; font-style: italic;">if</span> <span style="color: #b877db;">len</span>(lst) <span style="color: #b877db; font-style: italic;">==</span> <span style="color: #f09383;">0</span>:
        <span style="color: #b877db; font-style: italic;">return</span>
    <span style="color: #b877db; font-style: italic;">else</span>:
        <span style="color: #e95678;">elem</span>, <span style="color: #b877db; font-style: italic;">*</span>tail <span style="color: #b877db; font-style: italic;">=</span> lst
        <span style="color: #b877db;">print</span>(<span style="color: #fab795;">f"</span><span style="color: #b877db; font-style: italic;">{</span><span style="color: #c7c9cb; background-color: #232530;">elem</span><span style="color: #fab795;"> </span><span style="color: #b877db; font-style: italic;">=</span><span style="color: #fab795;"> </span><span style="color: #b877db; font-style: italic;">}</span><span style="color: #fab795;">"</span>)
        <span style="color: #21bfc2;">print_list</span>(tail)

<span style="color: #e95678;">lst</span> <span style="color: #b877db; font-style: italic;">=</span> [<span style="color: #fab795;">"Mark"</span>, <span style="color: #fab795;">"Kieran"</span>, <span style="color: #fab795;">"Nikhil"</span>]
<span style="color: #21bfc2;">print_list</span>(lst)
<span style="color: #b877db;">print</span>(lst)
</pre>
</div>

</section>
<section id="slide-org9ce5541">
<h3 id="org9ce5541">Exercise</h3>
<aside class="notes">
<p>
Our stack is looking less like a stack. but in any case I will ask yall to write
a function that takes in a function and recursively goes down the stack
transforming each element using the function
</p>

</aside>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">def</span> <span style="color: #87ceeb;">transform_stk</span>(<span style="color: #e95678;">stk</span>, <span style="color: #e95678;">transform_fn</span>):
    <span style="color: #b877db; font-style: italic;">pass</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org6e19a63">
<h2 id="org6e19a63">Lists, A lot of work done on them.</h2>
<aside class="notes">
<p>
I want to think about everything we have done here. a lot of cases we are doing
the same thing, recursing through lists manually not good and repeated code
should be setting off alarm bells for all yall, Python actually provides some
very useful operations
</p>

</aside>
</section>
<section id="slide-orgcc70307">
<h3 id="orgcc70307">Map transform an entire list using a function</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">return</span> <span style="color: #b877db;">list</span>(<span style="color: #b877db;">map</span>(<span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #e95678;">elem_from_list</span>: <span style="color: #f09383;">1</span> <span style="color: #b877db; font-style: italic;">+</span> elem_from_list, [<span style="color: #f09383;">1</span>,<span style="color: #f09383;">2</span>,<span style="color: #f09383;">3</span>,<span style="color: #f09383;">4</span>]))
</pre>
</div>

</section>
<section id="slide-orgaad7305">
<h3 id="orgaad7305">filter, remove elements that don&rsquo;t meet some kind of condition</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">return</span> <span style="color: #b877db;">list</span>(<span style="color: #b877db;">filter</span>(<span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #e95678;">elem</span>: elem <span style="color: #b877db; font-style: italic;">%</span> <span style="color: #f09383;">2</span> <span style="color: #b877db; font-style: italic;">==</span> <span style="color: #f09383;">0</span>, (<span style="color: #f09383;">1</span>,<span style="color: #f09383;">2</span>,<span style="color: #f09383;">3</span>,<span style="color: #f09383;">4</span>,)))
</pre>
</div>

</section>
<section id="slide-org0fa240c">
<h3 id="org0fa240c">reduce, take a list and sum it up in a neat way.</h3>
<aside class="notes">
<p>
reduce is the most powerful operation of these three, you can use reduce to
actually implement map and filter. Reduce gives you two arguments, an
accumulated value, and the current value. the return value is the new
accumulator.
</p>

</aside>

<p>
We can do things like
</p>
</section>
<section>
<p>
sum up a list
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">from</span> functools <span style="color: #b877db; font-style: italic;">import</span> reduce
<span style="color: #b877db; font-style: italic;">return</span> <span style="color: #21bfc2;">reduce</span>(<span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #e95678;">acc</span>, <span style="color: #e95678;">elem</span>: acc <span style="color: #b877db; font-style: italic;">+</span> elem, <span style="color: #b877db;">range</span>(<span style="color: #f09383;">10</span>), <span style="color: #f09383;">0</span>)
</pre>
</div>

<pre class="example">
45
</pre>


</section>
<section>
<p>
find the maximum element&#x2026;
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">from</span> functools <span style="color: #b877db; font-style: italic;">import</span> reduce
<span style="color: #b877db; font-style: italic;">return</span> <span style="color: #21bfc2;">reduce</span>(<span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #e95678;">max_elem</span>, <span style="color: #e95678;">curr</span>: <span style="color: #b877db;">max</span>(max_elem, curr), [<span style="color: #f09383;">4</span>, <span style="color: #f09383;">5</span>, <span style="color: #f09383;">3</span>, <span style="color: #f09383;">12</span>, <span style="color: #f09383;">1</span>, <span style="color: #f09383;">2</span>, <span style="color: #f09383;">11</span>], <span style="color: #f09383;">0</span>)
</pre>
</div>

<pre class="example">
12
</pre>


</section>
<section>
<p>
apply a transformation to each element&#x2026;
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">from</span> functools <span style="color: #b877db; font-style: italic;">import</span> reduce
<span style="color: #b877db;">print</span>(<span style="color: #21bfc2;">reduce</span>(<span style="color: #b877db; font-style: italic;">lambda</span> <span style="color: #e95678;">list_acc</span>, <span style="color: #e95678;">curr</span>: list_acc <span style="color: #b877db; font-style: italic;">+</span> [<span style="color: #b877db;">str</span>(curr)], [<span style="color: #f09383;">4</span>, <span style="color: #f09383;">5</span>, <span style="color: #f09383;">4</span>,  <span style="color: #f09383;">3</span>], []))
</pre>
</div>
<p>
so on&#x2026;
</p>
</section>
<section id="slide-orgd09c51d">
<h3 id="orgd09c51d">Exercize</h3>
<p>
Can we use reduce to push many elements onto a stack? at this point we should
also implement pop and push?
</p>

</section>
</section>
